{
    "1": {
        "title": "Hello World!",
        "post": "This has like... so many limitations right now, but I will make it better in the future.<br>I'll be sending some updates in here from time to time, don't expect much, though! (I'm very busy, haha...)<br>Like, seriously, what is this? (This is Renoise)<br>{renoiseWhat.png;150}How am I supposed to understand this? (Honestly this is very fun)",
        "date": "09/05/2023"
    },
    "2": {
        "title": "ETV and others",
        "post": "Hey again, been doing some stuff these days. I just experimented with Unity 3d and tried to re-remeber some of Unity's C#.<br>I've also made an online tierlist builder, made from pure js. (why didnt I use jQuery...)<br>{frumsTierlistExample.png;150}I've had some troubles getting the drag&drop to work, but I think it ended up pretty well.<br>...Will probably keep updating it with some very much needed QoL features, so stay tuned for more!<br>Oh yeah, I'm getting better at art :>",
        "date": "02/06/2023"
    },
    "3": {
        "title": "I uhh um...",
        "post": "Yep, that's right! I've done nothing for the past two months!<br>...<br>I mainly blame the Steam Summer Sale.<br>Okay! Okay! I DID join a studio for internships and updated the Origins Snippets extension, so that's that.<br>Happy now? ...yes?",
        "date": "10/07/2023, 27/08/2023"
    },
    "4": {
        "title": "2025 IS MY YEAR",
        "post": "YOOOOOOOO HAPPY NEW YEAR EVERYONE<br>CHECK OUT MY NEW GAME GRAVIX ON ITCH.IO PLEASE THANK YOUUU<br><a href='https://ugdev.itch.io/gravix'>[Gravix]</a>",
        "date": "01/01/2024"
    },
    "5": {
        "title": "Small update,,",
        "post": "I've been cooking... Games mostly. That's all!",
        "date": "24/03/2024"
    },
    "6": {
        "title": "Working working working",
        "post": "I'm working on a 2D \"sokoban\" game!<br>The game right now is open source, and in development. You can find it on my GitHub.<br>{ADC-LevelPreview.png;150}",
        "date": "05/06/2024"
    },
    "7": {
        "title": "ADC Demo",
        "post": "{ADCCover.png;75} Demo is OUT NOW!<br>Well, it was out like a week ago, but I forgot to make a blog post about it.<br><br>Check it out here:<br><a href='https://ugdev.itch.io/a-directionless-cycle'>[A Directionless Cycle - Demo]</a>",
        "date": "15/10/2024"
    },
    "8": {
        "title": "Happy new year!",
        "post": "2024 has been a wild year, between graduating, finding a job, developing a game,<br>learning new stuff, and changing zones of comfort, I'm exhausted.<br>I managed to do at least half the things I set out on doing, which is great!<br><br>Right now, I have quite some stuff cooking with ADC, and also sketching ideas for another game.<br>Life is great, and I'm working towards finding myself (or a sense, of what I am) more closely.<br><br>Lastly, as I've said, a year ago, 2025 is my year.<br>You'll hear from me soon enough.<br><a href='https://discord.gg/fNcyyES9gB'>[Discord Server]</a>",
        "date": "01/01/2025"
    },
    "9": {
        "title": "Wishlist ADC on Steam!",
        "post": "{../adc/ADCLibraryLogo.png;150} We have a Steam page now!<br><br>I'm expecting to release A Directionless Cycle around Q2 this year, <br>so I'd very much appreciate if you could wishlist the game on Steam.<br><br>I've also updated the demo for (hopefully) the last time!<br>It is playable on the Steam page only.<br><br>Check it out here:<br><a href='https://store.steampowered.com/app/3417520/A_Directionless_Cycle/'>[A Directionless Cycle - Steam]</a>",
        "date": "24/01/2025"
    },
    "10": {
        "title": "Pride + Dev Update",
        "post": "Been a while! I've been very busy at work with A Directionless Cycle and Polymorphite.<br>We're close to releasing with ADC and I REALLY wanna take a break, it's been quite a long development time.<br><br>Music isn't looking too well (it looks like it's not really my thing, somehow), but I'll still try to have something down for release.<br>...Maybe one or two tracks.<br><br>Aside from that, happy pride month!<br><br>{../flags/BI.png;70}I wish everyone an awesome month, you are valid and loved <3",
        "date": "08/06/2025"
    },
    "11": {
        "title": "Bird Update",
        "post": "Hey y'all. I've wanted to make a birthday post for a while now, but I had some \"personal issues\" at that time.<br><br>I'll start with the good! <b>Thank you SO, SO MUCH for everyone that's played A Directionless Cycle</b> and shared their journey through the game.<br>It's made me so happy to see everyone enjoying their time.<br><br>Currently I'm working on multiple small projects, with no release deadline. They'll both be free aswell.<br><br>As for the bad... I'm very burnt out at the moment, solo dev/indie dev doesn't pay the bills. It's been hell to find a job in the game development industry, and it doesn't help that more than half of your applications are rejected without reply, or after a gauntlet.<br><br>That's mostly it, just going through some stuff. Thank you for being there <3",
        "date": "14/09/2025"
    },
    "12": {
        "title": "New year, same me.",
        "post": "Happy new year! This'll be a brief post.<br><br>In short, 2025 was my year! I've accomplished most of the stuff I've set out to do, despite hardships and roadblocks.<br>These last few months have been rough, but we'll get there <3<br><br>As far as <a target='_blank' href='https://ugdev.xyz/terminal?cmd=cd%20/universe'>projects</a> go... It's been slow! Though, I do have some stuff to show off: {EOSCliTease.png;850}...I'd rather keep everything \"secret\" as of now, as most of it is just <a target='_blank' href='/assets/images/blog/GravixEOSTease.png'>development textures</a>.<br>I'll make sure to show off any dev related stuff afterwards!<br><br>And again, happy new year! I'm looking forward to this one.<br><b>With love, Lumi!</b>",
        "date": "01/01/2026"
    }
}