{
    "1": {
        "title": "Hello World!",
        "post": "This has like... so many limitations right now, but I will make it better in the future.<br>I'll be sending some updates in here from time to time, don't expect much, though! (I'm very busy, haha...)<br>Like, seriously, what is this? (This is Renoise)<br>{renoiseWhat.png}How am I supposed to understand this? (Honestly this is very fun)",
        "date": "09/05/2023"
    },
    "2": {
        "title": "ETV and others",
        "post": "Hey again, been doing some stuff these days. I just experimented with Unity 3d and tried to re-remeber some of Unity's C#.<br>I've also made an online tierlist builder, made from pure js. (why didnt I use jQuery...)<br>{frumsTierlistExample.png}I've had some troubles getting the drag&drop to work, but I think it ended up pretty well.<br>...Will probably keep updating it with some very much needed QoL features, so stay tuned for more!<br>Oh yeah, I'm getting better at art :>",
        "date": "02/06/2023"
    },
    "3": {
        "title": "I uhh um...",
        "post": "Yep, that's right! I've done nothing for the past two months!<br>...<br>I mainly blame the Steam Summer Sale.<br>Okay! Okay! I DID join a studio for internships and updated the Origins Snippets extension, so that's that.<br>Happy now? ...yes?",
        "images": [],
        "date": "10/07/2023, 27/08/2023"
    },
    "4": {
        "title": "2025 IS MY YEAR",
        "post": "YOOOOOOOO HAPPY NEW YEAR EVERYONE<br>CHECK OUT MY NEW GAME GRAVIX ON ITCH.IO PLEASE THANK YOUUU<br><a href='https://ugdev.itch.io/gravix'>[Gravix]</a>",
        "images": [],
        "date": "01/01/2024"
    },
    "5": {
        "title": "Small update,,",
        "post": "I've been cooking... Games mostly. That's all!",
        "images": [],
        "date": "24/03/2024"
    },
    "6": {
        "title": "Working working working",
        "post": "I'm working on a 2D \"sokoban\" game!<br>The game right now is open source, and in development. You can find it on my GitHub.<br>{ADC-LevelPreview.png}",
        "date": "05/06/2024"
    },
    "7": {
        "title": "ADC Demo",
        "post": "{ADCCover.png} Demo is OUT NOW!<br>Well, it was out like a week ago, but I forgot to make a blog post about it.<br><br>Check it out here:<br><a href='https://ugdev.itch.io/a-directionless-cycle'>[A Directionless Cycle - Demo]</a>",
        "date": "15/10/2024"
    },
    "8": {
        "title": "Happy new year!",
        "post": "2024 has been a wild year, between graduating, finding a job, developing a game,<br>learning new stuff, and changing zones of comfort, I'm exhausted.<br>I managed to do at least half the things I set out on doing, which is great!<br><br>Right now, I have quite some stuff cooking with ADC, and also sketching ideas for another game.<br>Life is great, and I'm working towards finding myself (or a sense, of what I am) more closely.<br><br>Lastly, as I've said, a year ago, 2025 is my year.<br>You'll hear from me soon enough.<br><a href='https://discord.gg/fNcyyES9gB'>[Discord Server]</a>",
        "date": "01/01/2025"
    }
}